IdeaRS.OpenModel.Material.MatPrestressSteelSIA
Material prestressing steel SIA

IdeaRS.OpenModel.Material.MatPrestressSteelSIA.#ctor
Constructor

IdeaRS.OpenModel.Material.MatPrestressSteelSIA.Fpk
characteristic value of tensile strength of prestressing steel

IdeaRS.OpenModel.Material.MatPrestressSteelSIA.Fp01k
characteristic value of yield strength of prestressing steel

IdeaRS.OpenModel.Material.MatPrestressSteelSIA.Epsuk
characteristic value of ultimate strain of reinforcing steel or strain at maximum load for prestressing steel

IdeaRS.OpenModel.Material.MatPrestressSteelSIA.Fpd
dimensioning value of yield strength of prestressing steel

IdeaRS.OpenModel.Material.MatPrestressSteelSIA.Epsud
dimensioning value of ultimate strain of reinforcing steel or prestressing steel

IdeaRS.OpenModel.Material.MatPrestressSteelSIA.Type
Type of prestress steel

IdeaRS.OpenModel.Material.MatPrestressSteelSIA.SurfaceCharacteristic
Surface characteristic

IdeaRS.OpenModel.Material.MatPrestressSteelSIA.DiagramType
Type of diagram